[{
		"name": "What is the point of elastic man game?",
		"description": "Elastic Man Online is a 3D face stretching game that showcases the rich capabilities of modern browser technologies. Elastic Man Online is a 3D face stretching game that showcases the rich capabilities of modern browser technologies.",
		"img": "https://www.gamerocco.com/uploads/images/thumbs/elastic-man-2-6225.jpg"
	},
	{
		"name": "Is elastic man free?",
		"description": "Elastic Man Game · Play Online For Free.",
		"img": "https://imgs2.dab3games.com/elastic-man-game.png"
	}, {
		"name": "Who is the elastic man?",
		"description": "Elongated Man (Randolph Dibny) is a fictional character, a superhero appearing in American comic books published by DC Comics.",
		"img": "https://static.arcadespot.com/wp-content/uploads/2020/06/elastic-man-164x164.png"
	}, {
		"name": "What is the Morty face game?",
		"description": "Morty Stretchy Face is an online skill game that we hand picked for Lagged.com. This is one of our favorite mobile skill games that we have to play. Simply click the big play button to start having fun. If you want more titles like this, then check out Teeth Runner or Elastic Among Us.",
		"img": "https://static.arcadespot.com/wp-content/uploads/2020/06/elastic-man-164x164.png"
	}, {
		"name": "What do you do in elastic man?",
		"description": "Elastic Man is a goofy time-waster which lets you stretch, bend, and deform the character's face right in your web browser.",
		"img": "https://imgs2.dab3games.com/elastic-man-game.png"
 }, {
		"name": "What is the game where you stretch Morty's face?",
		"description": "Pull and stretch Morty from Rick and Morty in this funny online game. Simply tap and hold different parts of the face and stretch! Have fun in this silly game by David Li. Elastic Man is an online skill game that we hand picked for Lagged.com.",
		"img": "https://static.arcadespot.com/wp-content/uploads/2020/06/elastic-man-164x164.png"
	}, {
		"name": "Who created the game Elastic man?",
		"description": "Beano staff",
		"img": "https://static.arcadespot.com/wp-content/uploads/2020/06/elastic-man-164x164.png"
}, 
	}
]
